{
  "title": "{file}",
  "date": "09/19/25",
  "type": "Elements",
  "brief": [
    "Detailed report of current Element A findings and analysis."
  ],
  "elements": [
    {
      "type": "PDF",
      "items": [
        {
          "label": "Element A Report",
          "src": "resources/{class}/{type}/{title}/{title}.pdf"
        }
      ]
    },
    {
      "type": "notes",
      "label": "Problem Statement",
      "content": "The team has found that commercial offerings labeled as girls’ STEM toys' often present narrower technical content, stereotyped themes, and uneven value relative to gender-neutral alternatives, which can dampen girls’ early interest in STEM."
    },
    {
      "type": "notes",
      "label": "Statement of Purpose",
      "content": "The team will design, build, and test a STEM construction kit that engages young learners using evidence-based principles from child development and the learning sciences, prioritizing authentic inquiry and identity-affirming materials without reliance on gendered colored cues or “pink” signaling."
    },
    {
      "type": "reference",
      "label": "Ten Mighty Questions of EDD",
      "target": "EDD/[W3] The Ten Mighty Questions of EDD"
    },
    {
      "type": "notes",
      "label": "Problem Background and Statistics",
      "content": "The team’s market research synthesizes findings from three currently marketed products and three relevant patents to characterize the market space for girls’ STEM toys. The reviewed products target learners roughly ages 3-12 and carried by mainstream retailers as well as educational suppliers, indicating ready discoverability and present market demand. Patent activity within the same space, explicitly including a patent targeted towards encouraging girls’ interest in STEM, corroborates that industry actors already recognize both the need and commercial potential of solutions focused on girls’ engagement. Together, these sources establish an actual baseline for the problem. Quantitatively, the team’s research covered many price bands, with list prices ranging from $23 to $150 with sale prices listed near ~$13 for budget sets and ~$120 for premium kits. Such dispersion matters for equity of access and for parental value judgements at the time of purchase, particularly when ongoing consumables or unclear instructions dilute learning value over time. Qualitatively, two of the three products researched explicitly marketed themselves as “for girls”, while one positioned itself as “boys & girls”, revealing mixed norms in audience signaling that can shape caregiver reception and children’s expectations before play even begins. Content analyses further indicate uneven depth: while several products provide credible STEM affordances (e.g., microscopy or mechanical construction), others leaned heavily on themed aesthetics or consumable-heavy activities that offer limited pathways for sustainable inquiry without additional purchases. Figures A-B (prices and marketing languages) visualize these patterns and invigorate the team’s emphasis on authentic inquiry, modular challenge progressions, and neutral, mechanics-first branding in the proposed design."
    },
    {
      "type": "reference",
      "label": "Research Summary Sheet",
      "target": "EDD/[W4] EDD Research Summary Sheet"
    },
    {
      "type": "reference",
      "label": "Patent Summary Sheet",
      "target": "EDD/[W5] EDD Patent Summary Sheet"
    },
    {
      "type": "reference",
      "label": "Product Critique Sheet",
      "target": "EDD/[W5] EDD Product Critique Sheet"
    },
    {
      "type": "image",
      "src": "resources/{class}/{type}/{title}/FIGURE A.png",
      "label": "Figure A – List vs. Sale Prices of Reviewed STEM Toys"
    },
    {
      "type": "image",
      "src": "resources/{class}/{type}/{title}/FIGURE B.png",
      "label": "Figure B – Marketing Language of Reviewed Products: Gendered vs. Neutral/Inclusive (Note: Sample size is small.)"
    }

  ]
}
