{
  "title": "{file}",
  "date": "11/17/25",
  "type": "Elements",
  "brief": [
    "Detailed report of current Element C findings and analysis."
  ],
  "elements": [
    {
      "type": "PDF",
      "items": [
        {
          "label": "Element C Report",
          "src": "resources/{class}/{type}/{title}/{title}.pdf"
        }
      ]
    },
    {
      "type": "image",
      "src": "resources/{class}/{type}/{title}/GANTT CHART.png",
      "label": "Gantt Chart Showcasing the Team's Progress"
    },
    {
      "type": "notes",
      "label": "Problem Statement",
      "content": "Commercially available STEM toys designed for children—particularly those marketed towards girls—often fail to sustain inquiry-driven engagement through narrower technical content, stereotyped themes, and uneven value relative to gender-neutral alternatives, which can dampen girls’ early interest in STEM."
    },
    {
      "type": "notes",
      "label": "Introduction",
      "content": "The M.O.J.O. team has undertaken a comprehensive, evidence-based process to determine design requirements and benchmarks for an inclusive STEM construction kit. This process integrated market analysis of existing products and patents, consumer surveys, expert consultations with child development specialists Dr. Grace Paradis and Dr. Nancy Dayne, and systemic review of peer-reviewed literature on informal STEM learning. Our primary stakeholders include parents and guardians (the primary purchasers and decision-makers), educators seeking classroom-ready materials that support authentic inquiry, and children ages 6-12 (the end users). Secondary stakeholders include manufacturers who must balance educational integrity with production economics, and retailers seeking products that address documented market gaps. Through this multi-stakeholder approach, we identified convergent evidence pointing to specific, measurable design criteria that address both the educational shortcomings and the equity barriers present in current market offerings."
    },
    {
      "type": "notes",
      "label": "Presentation & Justification of Solution Design Requirements",
      "content": "Market Information<br>Our October 2025 market analysis reveals a fragmented landscape characterized by inconsistent value propositions and persistent gender-coded marketing. Existing products span a price range from $13 (budget magnetic tiles) to $150+ (premium robot kits), with most “girls’ STEM toys” positioned at the lower to middle tiers. Qualitative analysis of three representative products—Butterfly EduFields Girls Mini Engineering Kit ($23) WhalesBot B3 Pro ($150), and Rurvale Magnetic titles ($13-23)—revealed recurring patterns: confusing instructions that undermined independent use, stereotyped project themes (hair dryers, vacuums), limited mechanical depth, and reliance on consumables or themed aesthetics rather than sustainable engineering challenges. Patent searches corroborated industry recognition of this gap, with specific filings (Jichi 2016, US20170144081A1) explicitly targeting “girls’ interest in STEM” through gendered theming rather than pedagogical innovation.<br>Consumer data validates the market opportunity. Our survey demonstrated that 60.8% of respondents consider STEM toys highly important for child development, yet 61.1% simultaneously recognize that toys are not marketed equally toward boys and girls. This disconnect represents both a problem and an opportunity: demand exists, but current supply fails to meet it equitably. Affordability emerged as the dominant purchasing constraint, with 44.2% of respondents identifying cost as a top priority. Notably, 83.6% of respondents had building sets as children, indicating broad familiarity with construction-based play and a receptive market for modular mechanical toys.<br>Target Consumer<br>Our target consumer operates on two levels. The end user is a child aged 6-12, with particular emphasis on girls and underrepresented groups who face documented barriers in STEM identity formation. This age range captures the critical development window when spatial reasoning, causal thinking, and self-efficacy beliefs are highly malleable. However, our research confirms that parents and guardians are the primary purchasers and the essential mediators of sustained child-engagement. Expert interviews with Dr. Nancy Dayne emphasized that “parents play the largest role in how kids use STEM toys”—not merely through purchase decisions, but through active guidance that scaffolds persistence and confidence.<br>Estimation of Production Construction<br>The proposed modular rover kit will be constructed using classroom-available prototyping materials and technologies, with clear pathways for potential cost optimization should the project advance beyond the prototype phase.<br>Prototype Construction Approach<br>The prototype will leverage accessible fabrication tools available at MLKHS and commercially available off-the-shelf components. Structural components—chassis, motor mounts, sensor brackets, and connectors—will be 3D-printed using FDM (fused deposition modeling) with ABS/PLA filament, enabling rapid design iteration and specification testing. Electronic systems will utilize readily available off-the-shelf modules: commodity DC motors (3-6V), Arduino-compatible or STM32-compatible microcontroller development boards, standard ultrasonic distance and color sensors, and consumer lithium-ion battery packs with integrated UBS charging circuits. This component selection prioritizes design validation, specification testing, and assembly within our $200 prototype budget and school-year timeline. Estimated prototype cost is $50-70 per complete (building two rovers).<br>Potential Production Pathway<br>Should this project advance to commercial viability, significant cost optimization opportunities exist that would enable the target retail price of $30-50. Structural components currently 3D-printed could transition to injection molding—reducing per-unit costs from $8-12 to $0.50-2.00 at production volumes exceeding 1,000 units while maintaining the validated architecture. Electronic systems could shift from development boards to custom PCBs with integrated microcontrollers and consolidated sensor circuits, and motors could be sourced through high-volume manufacturers rather than hobby suppliers. These manufacturing optimizations could achieve the <$25 unit production cost target while preserving all features. However, such production planning currently falls outside the scope of our current prototype development phase.<br>Core Technologies (Prototype Implementation)<br>Mechanical Systems<br>Chassis, modular motor mounts, interchangeable wheel assemblies, and sensor mounting brackets. All connectors are planned to utilize keyed, polarized interfaces to prevent incorrect assembly. <br>Electronic Systems<br>Low-voltage DC motors (3-6V), rechargeable lithium-ion battery pack with USB-C charging, Arduino-compatible or STM32-compatible microcontroller boards programmed for multiple complexity tiers (line-following with color sensors, obstacle avoidance with ultrasonic sensors, driving straight), and LED indicators for system status feedback. All electronics operate at <9V for safety compliance. <br>Assembly Strategy <br>The kit is designed for assembly in <30 minutes, with all connectors keyed to prevent errors. One kit is planned to contain sufficient components to build two complete rovers simultaneously, enabling racing, collaborative experimentation, and comparative-testing."
    },
    {
      "type": "notes",
      "label": "Product Specifications",
      "content": "These specifications translate the customer requirements into precise, testable, pass/fail criteria that will guide prototype development and validation testing:\u003cbr\u003eRetail Price \u003c$60; Projected Unit Production Cost \u003c$25 At Scale\u003cbr\u003ePrototype bill of materials (BOM) must total \u003c$70 per complete kit (building two rovers) using classroom-available components and small-quantity pricing. A parallel costing analysis will document projected component costs at production volumes of 1,000+ units, demonstrating feasibility of achieving ≤$25 unit cost through injection molding, custom PCBs, and volume supplier pricing—thereby validating the commercial viability pathway without requiring actual production.\u003cbr\u003ePASS if prototype BOM \u003c$70 AND projected at-scale BOM\u003c$25 (with documented vendor quotes or industry-standard cost models); FAIL if prototype \u003e$70 OR projected costs cannot demonstrate \u003c$25 feasibility.\u003cbr\u003eThis dual-metric specification acknowledges the realities of prototype development while maintaining accountability to the affordability requirement identified by 44.2% of consumers. The $70 prototype threshold reflects small-quantity component pricing, 3D printing material costs, and classroom fabrication constraints, while still demonstrating cost-consciousness and efficient design decisions.\u003cbr\u003eMinimal-Tool Assembly In \u003c30 Minutes; All Connectors Keyed/Polarized\u003cbr\u003eUsability testing must demonstrate median assembly time \u003c30 minutes for first rover. Assembly should require only basic hand tools (screwdriver, hex key)—no specialized equipment or soldering. Electronic connectors must be keyed/polarized to prevent incorrect assembly.\u003cbr\u003ePASS if median \u003c30 minutes using basic tools and zero wiring errors; FAIL if \u003e30 minutes, requires specialized tools, or connection errors occur.\u003cbr\u003eThe 30-minute target balances meaningful construction with age-appropriate attention spans. Basic tools allow robust mechanical connections (screws for motors/battery) while keyed electronic connectors prevent wiring errors, maintaining accessibility for non-technical families per expert recommendations.\u003cbr\u003eRuntime \u003e45 Minutes Per Charge; 5v Usb Charging\u003cbr\u003eRovers must operate continuously for \u003e45 minutes under standard duty cycle (50% active movement, 50% idle with active sensors) before requiring recharge. Battery must recharge via standard 5V USB-C connection compatible with common household chargers.\u003cbr\u003ePASS if runtime ≥45 minutes and charges via 5V USB; FAIL if runtime \u003c45 minutes or requires proprietary charging.\u003cbr\u003eThe 45-minute runtime target accommodates typical play sessions and structured lesson plans without interruption. This specification supports the 'reusability' requirement by eliminating consumable batteries and enabling sustainable, cost-free recharging. USB compatibility leverages existing household infrastructure and avoids additional costs or complexity.\u003cbr\u003eLine-Following At 0.1-0.3m/S With \u003e85% Track Completion On Matte Paper\u003cbr\u003eMid-complexity brain module (line-following mode) must successfully complete \u003e85% of a standardized test track (black electrical tape on white matte paper, including 90° turns, gentle curves, and straight segments totaling 3 meters) at speeds between 0.1-0.3 m/s. Success defined as rover maintaining path without leaving track boundaries.\u003cbr\u003ePass/Fail Values: PASS if \u003e85% track completion at specified speeds; FAIL if \u003c85% completion or requires multiple attempts.\u003cbr\u003eLine-following provides an observable, measurable demonstration of sensor-based autonomous behavior—core STEM content that distinguishes this product from purely mechanical building sets. The 85% threshold accounts for sensor noise and environmental variability while ensuring reliable performance. The speed range balances observable functionality (fast enough to be engaging) with control (slow enough for children to observe and understand cause-effect relationships).\u003cbr\u003eDrop Resilience From 0.8m Onto Vinyl\u003cbr\u003eFully assembled rover must survive three drops from 0.8m height onto standard vinyl flooring without mechanical failure, electrical disconnection, or loss of functionality. Post-test operational checks must confirm all motors, sensors, and connections remain functional.\u003cbr\u003ePASS if all systems functional after three 0.8m drops; FAIL if any mechanical breakage, disconnection, or functional loss occurs.\u003cbr\u003eThe 0.8m drop height approximates typical table height (relevant for classroom use) and represents realistic accident scenarios for the target age group. This specification operationalizes the 'durability' requirement from consumer feedback and ensures the product survives normal play patterns. Three-drop testing accounts for repeated incidents rather than single-event resilience."
    },
    {
      "type": "reference",
      "label": "Design and Product Specification",
      "target": "EDD/[W9] Element C 4.0 Design and Product Specification"
    },
    {
      "type": "reference",
      "label": "Design Brief",
      "target": "EDD/[W11] EDD Element C Design Brief"
    },
    {
      "type": "reference",
      "label": "Customer Design Requirements",
      "target": "EDD/[W11] Element C 3.0 Customer Design Requirements"
    },
    {
      "type": "notes",
      "label": "Similar Solutions Matrix",
      "content": "The matrix evaluated seven design concepts (four M.O.J.O. concepts and three existing products) against nine criteria, scored 1-5.<br>TOP SCORES<br>•\tM.O.J.O. Modular Rover (37/45) - Best overall balance: affordability (4), modularity (5), co-play support (4), gender neutrality (5)<br>•\tM.O.J.O. Tinker Kit (33/45) & Sillbird Solar Robot (33/45) - Strong modularity but Sillbird suffers from poor affordability (2) and durability (2)<br>LOWEST SCORES<br>•\tLucky Doug Kit (28/45) - Limited modularity (3), poor reusability (3), weak co-play (2)<br>•\tJumping Frog (30/45) - Too simple: modularity (1), complexity (2), co-play (1)<br>•\tScreenless Toy (31/45) - Poor affordability (1), weak aesthetics (3), minimal co-play (2)<br>Modularity and co-play support emerge as the critical differentiators—all top-scoring solutions achieved modularity scores of 5, while lower performers scored 1-3. However, modularity alone is insufficient: the Sillbird Robot's high modularity (5) cannot compensate for poor affordability (2) and weak co-play (3). The Modular Rover's 37/45 score represents optimal balance: it matches competitors' modularity (5) and gender neutrality (5) while maintaining superior affordability (4 vs. 2) and structured co-play support (4 vs. 1-3). This validates our research-driven emphasis on simultaneously addressing multiple barriers rather than optimizing single features."
    },
    {
      "type": "reference",
      "label": "Decision Matrix",
      "target": "EDD/[W12] EDD Element C Decision Matrix"
    },
    {
      "type": "reference",
      "label": "Similar Solution Matrix",
      "target": "EDD/[W9] EDD Element C5.0 Similar Solution Matrix"
    },
    {
      "type": "notes",
      "label": "Expert Review",
      "content": "Dr. Grace Paradis, Ph.D. (CSU Stanislaus, Oct 15, 2025)<br>• Recommended neutral/mixed colors to avoid stereotypes -> informed mechanics-first design<br>• Suggested dual marketing (neutral + girl-targeted packaging with identical content)<br>• Emphasized safety and cost-effectiveness for parental purchase decisions -> <$50 price target<br>Dr. Nancy Dayne, Ed.D. (CSU Long Beach, Oct 22, 2025)<br>• 'Parents play the largest role in how kids use STEM toys' -> elevated co-play to Requirement #2<br>• Stressed authentic educational value over novelty<br>• Noted packaging/colors strongly influence perception -> validated neutral aesthetics<br>Consumer Feedback (Survey, Product Reviews, Parent Interviews):<br>• Validated affordability priority (44.2%), gender marketing problem (61.1%)<br>• Reviews cited recurring issues: fragile construction, confusing instructions, limited replay value<br>• Parents want toys that 'grow with the child' and avoid heavy gendered marketing<br>Key Changes Based On Feedback<br>• Co-play elevated from secondary feature to Requirement #2<br>• Kit redesigned to build two rovers (enables racing/collaboration per expert suggestions)<br>• Assembly simplified to basic tools only (addresses parent frustration with complex assembly)<br>• Price target tightened to <$22 production cost (responds to affordability emphasis)"
    },
    {
      "type": "reference",
      "label": "Expert Review - PR1 Project Proposal Feedback Analysis",
      "target": "EDD/[W11] Element C [Expert Feedback] 6.0 Expert Review - PR1 Project Proposal Feedback Analysis"
    },
    {
      "type": "reference",
      "label": "Email to Professionals",
      "target": "EDD/[W9] Email to Professionals"
    },
    {
      "type": "notes",
      "label": "Conclusion",
      "content": "Element C defines a coherent set of design requirements and product specifications that together position the M.O.J.O. modular rover kit as a practical response to the documented gaps in existing STEM toys marketed toward girls. These requirements—centered on affordability, opportunities for co-play, developmental appropriateness for ages 6–12, durability in everyday classroom and home use, and authentic engineering inquiry—are expressed as measurable targets for cost, assembly time, runtime, line-following performance, and drop resilience. Because each specification is defined as a pass/fail criterion, it can be directly converted into testing scenarios such as prototype cost analysis, timed assembly trials with children and parents, controlled runtime and charging tests, standardized line-following courses, and repeated drop tests on vinyl flooring. Results from these tests will indicate whether the prototype truly meets stakeholder expectations for an accessible, reusable, and educationally meaningful STEM kit rather than a one-time novelty toy. In this way, the requirements and specifications outlined in Element C create a clear pathway from the original problem statement to a tangible solution attempt that can be objectively evaluated and iterated. Data from prototype testing will also provide feedback on instructions, component choices, and module difficulty levels, allowing refinement of the kit so it supports sustained engagement as users’ skills grow. Looking forward to Element D, our next step is to fabricate and test full working prototypes against these specifications, analyze the results, and use them to guide any design changes needed before finalizing the product concept."
    }
  ]
}